src/DataProcessors/док_Чтение_1CV8Clst_lst_ЗагрузкаВ_БД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>док_Чтение_1CV8Clst_lst_ЗагрузкаВ_БД</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/док_ТипБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>док_ТипБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MS_SQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Oracle</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IBM_DB2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентСерверная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/док_БД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>док_БД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддержка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_ПоддержкаКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_ТипБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьК_БД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКХранилищу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_СУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_ВерсииКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпубликованаНаWebСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebСервер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_WebСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиБД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольЗашифрован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПользователиХранилища</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольЗашифрован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/док_СУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>док_СУБД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СУБД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.док_ТипБД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольЗашифрован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платформы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.док_ВерсииПлатформы1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрядность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.док_Разрядность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонПортов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/док_Чтение_1CV8Clst_lst_ЗагрузкаВ_БД/Forms/Форма/Ext/Form/Module.bsl
// =============== M[2][Сч] =================
//0  УИД базы					"64a13ab8-6d80-42f1-9e0a-9b20bdb7f33b"	Строка
//1  Наименование				"ERP"	Строка
//2  Описание					"Демо база"	Строка
//3  Тип СУБД					"MSSQLServer"	Строка
//4  Сервер баз данных			"SQL2"	Строка
//5  База данных				"ERP"	Строка
//6  Пользователь сервера БД	"sa"	Строка
//7  Пароль пользователя БД		"iCWEFn46iXu5gwrBCQCC0scf4rRvow/U5t/qTe2JN9Y="	Строка
//8  .служебная строка			"CrSQLDB=Y;DB=ERP;DBMS=MSSQLServer;DBSrvr=SQL2;DBUID=sa;Descr="Демо база";LicDstr=Y;Locale=ru_RU;Ref=ERP;SchJobDn=Y;SLev=0;SQLYOffs=2000;Srvr=Serv1C:1441"	Строка
//9  Защищенное соединение		"0"	Строка
//10 Данные о блокировке		Массив	Массив
//		0 Блокировка начала сеансов включена
//		1 Дата начала в формате 00010101000000
//		2 Дата конца в формате 00010101000000
//		3 Сообщение блокировки
//		4 Код разблокировки
//		5 Параметр блокировки
//11 Блокировка регл.заданий	"1"	Строка	
//12 Разрешить выдачу лицензий	"1"	Строка
//13 Внешнее управление сеансами ""	Строка	(!! в 8.2 нет !!)
//14 Обязательное использование внешнего управления	"0"	Строка	(!! в 8.2 нет !!)
//15 Профиль безопасности		""	Строка	(!! в 8.2 нет !!)
//16 Профиль безопасности безопасного режима ""	Строка	(!! в 8.2 нет !!)
//17 							"1950" или "7872317"	Строка (!! в 8.3.4.496 нет !!)
// ==========================================

&НаКлиенте
Процедура ФайлНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Фильтр = НСтр("ru = ""Текст""; en = ""Text""")+"(*.lst)|*.lst"; 
	ДВФ.МножественныйВыбор = Ложь; 
	ДВФ.Заголовок = "Выберите файл 1CV8Clst.lst или 1CV8Reg.lst";
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора( Новый ОписаниеОповещения("КаталогНачалоВыбораЗавершение",ЭтотОбъект),ДВФ);	 
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;  
    ФайлНастроек = Результат[0];  
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	
	Ф = Новый ЧтениеТекста(ФайлНастроек,,,,Ложь);
	ТекстСтрокой= Ф.Прочитать();
	Ф.Закрыть();
		
	ПрочитатьСервер(ТекстСтрокой);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСервер(ТекстСтрокой)
	
	БД.Очистить();	
	
	М = РазобратьСтроку(ТекстСтрокой);
	
	Для Сч=1 По М[2].ВГраница() Цикл
		
		ОписаниеБазы = М[2][Сч];
		
		СтрБД = БД.Добавить();
		СтрБД.Гуид = ОписаниеБазы[0];
		СтрБД.ИмяВКластере = ОписаниеБазы[1];
		СтрБД.Описание = ОписаниеБазы[2];
		СтрБД.ТипБД = ОписаниеБазы[3];
		СтрБД.СУБД = ОписаниеБазы[4];
		СтрБД.ИмяИБ_В_СУБД = ОписаниеБазы[5];
		СтрБД.ИмяПользователяСУБД = ОписаниеБазы[6];
		
		СтрБД.БД = Справочники.док_БД.НайтиПоРеквизиту("ИмяИБ",СтрБД.ИмяВКластере);
		СтрБД.Кластер1С = Кластер1С;
		СтрБД.Клиент = Клиент;
		СтрБД.СУБД_ = Справочники.док_СУБД.НайтиПоНаименованию(СтрБД.СУБД);
		Если СтрБД.СУБД_.Пустая() И НЕ СтрБД.БД.Пустая() Тогда
			СтрБД.СУБД_ = СтрБД.БД.СУБД;
		КонецЕсли;	
		Если СтрБД.ТипБД = "MSSQLServer" Тогда		
			СтрБД.ТипБД_ = Перечисления.док_ТипБД.MS_SQL;                       
		ИначеЕсли СтрБД.ТипБД = "PostgreSQL" Тогда
			СтрБД.ТипБД_ = Перечисления.док_ТипБД.PostgreSQL;
		ИначеЕсли СтрБД.ТипБД = "Oracle" Тогда
			СтрБД.ТипБД_ = Перечисления.док_ТипБД.Oracle;
		ИначеЕсли СтрБД.ТипБД = "IBMDB2" Тогда
			СтрБД.ТипБД_ = Перечисления.док_ТипБД.IBM_DB2;	
		КонецЕсли;
		СтрБД.ФлЗагрузки = СтрБД.БД.Пустая();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РазобратьСтроку(Строка, ТекущийМассив = Неопределено)
	ПризнакКавычкиОткрыты = Ложь;
	ПризнакПерваяКавычкаБыла = Ложь;				
	ТекущееЗначение = "";
	Пока СтрДлина(Строка)>0 Цикл
		ПервыйСимвол = Лев(Строка,1);
		Если ПризнакКавычкиОткрыты Тогда
			// кавычка
			Если ПервыйСимвол="""" И НЕ ПризнакПерваяКавычкаБыла Тогда
				Строка = Сред(Строка,2);
				ПризнакПерваяКавычкаБыла=Истина;
			ИначеЕсли ПервыйСимвол="""" И ПризнакПерваяКавычкаБыла Тогда
				Строка = Сред(Строка,2);
				ТекущееЗначение = ТекущееЗначение + ПервыйСимвол;
				ПризнакПерваяКавычкаБыла=Ложь;
			// не кавычка
			ИначеЕсли ПризнакПерваяКавычкаБыла Тогда
				ПризнакКавычкиОткрыты=Ложь; // строку не обрезаем, тот же символ пойдет по основной ветке
				ПризнакПерваяКавычкаБыла=Ложь;
			Иначе
				Строка = Сред(Строка,2);
				ТекущееЗначение = ТекущееЗначение + ПервыйСимвол;
				ПризнакПерваяКавычкаБыла=Ложь;
			КонецЕсли;
		Иначе
			Если (ПервыйСимвол=Символы.ПС) ИЛИ (ПервыйСимвол=Символы.ВК) Тогда
				Строка = Сред(Строка,2);
			ИначеЕсли ПервыйСимвол="{" Тогда
				Строка = Сред(Строка,2);
				ВложенныйМассив = Новый Массив;
				ТекущееЗначение = РазобратьСтроку(Строка, ВложенныйМассив);
			ИначеЕсли ПервыйСимвол="}" Тогда
				ТекущийМассив.Добавить(ТекущееЗначение);
				Строка = Сред(Строка,2);
				Возврат ТекущийМассив;
			ИначеЕсли ПервыйСимвол="," Тогда
				Строка = Сред(Строка,2);
				ТекущийМассив.Добавить(ТекущееЗначение);
				ТекущееЗначение = "";
			ИначеЕсли ПервыйСимвол="""" Тогда
				Строка = Сред(Строка,2);
				ПризнакКавычкиОткрыты = Истина;
			Иначе
				Строка = Сред(Строка,2);
				ТекущееЗначение = ТекущееЗначение + ПервыйСимвол;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ТекущееЗначение;
КонецФункции

&НаКлиенте
Процедура УстановитьФлаг(Команда)
	ИзменитьФлагНаСервере(Истина);
КонецПроцедуры 

&НаСервере
Процедура ИзменитьФлагНаСервере(Флаг)
	Для каждого стр из бд цикл
		стр.ФлЗагрузки = Флаг;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаг(Команда)
	ИзменитьФлагНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКластерВ_Таб(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Для каждого стр из бд цикл
		стр.Кластер1С = Кластер1С;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСправочник(Команда)
	ЗагрузитьВСправочникНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВСправочникНаСервере()
	Для каждого стр из бд цикл
		Если стр.ФлЗагрузки Тогда
			Если стр.бд.Пустая() Тогда 
				ОбБД = Справочники.док_БД.СоздатьЭлемент();
			Иначе
				ОбБД = стр.бд.ПолучитьОбъект();
			КонецЕсли;	
			ОбБД = Справочники.док_БД.СоздатьЭлемент();
			ОбБД.Наименование = стр.ИмяВКластере;
			ОбБД.ИмяИБ = стр.ИмяВКластере;
			ОбБД.ИмяИБ_В_СУБД = стр.ИмяИБ_В_СУБД;
			ОбБД.СУБД = стр.субд_;
			ОбБД.Клиент = стр.Клиент;
			ОбБД.Сервер = стр.Кластер1С;
			ОбБД.ТипБД = стр.ТипБД_;
			ОбБД.Описание = ?(ОбБД.Описание = "",стр.Описание,ОбБД.Описание);
			ОбБД.Записать();
			стр.бд = ОбБД.Ссылка; 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлиентаВ_Таб(Команда)
	ЗаполнитьКлиентаВ_ТабНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлиентаВ_ТабНаСервере()
	Для каждого стр из бд цикл
		стр.Клиент = Клиент;
	КонецЦикла;
КонецПроцедуры
